---
title: AppearanceAssetEditScope
classe: Autodesk.Revit.DB.Visual.AppearanceAssetEditScope
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# AppearanceAssetEditScope

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsActive { get; }` | `appearanceAssetEditScope.IsActive` | Boolean |
| `Boolean IsValidObject { get; }` | `appearanceAssetEditScope.IsValidObject` | Boolean |
| `Void Cancel()` | `appearanceAssetEditScope.Cancel()` | Void |
| `Void Commit(Boolean)` | `appearanceAssetEditScope.Commit(updateOpenViews)` | Void |
| `Void Dispose()` | `appearanceAssetEditScope.Dispose()` | Void |
| `Asset Start(ElementId)` | `appearanceAssetEditScope.Start(assetElementId)` | Asset |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```